sle118/squeezelite-esp32/components/squeezelite/output_i2s.c
		fullness = gettime_ms();

		if (bytes != oframes * BYTES_PER_FRAME) {
			LOG_WARN("I2S DMA Overflow! available bytes: %d, I2S wrote %d bytes", oframes * BYTES_PER_FRAME, bytes);
		}
		
		SET_MIN_MAX( TIME_MEASUREMENT_GET(timer_start),i2s_time);
		
	}

	if (spdif.enabled) free(spdif.buf);
	ended = true;

	vTaskDelete(NULL);	
}

/****************************************************************************************
 * stats output callback
 */
static void i2s_stats(uint32_t now) {
    static uint32_t last;
    
    // first chain to next handler
    if (pseudo_idle_chain) pseudo_idle_chain(now);
    
    // then see if we need to act
    if (output.state <= OUTPUT_STOPPED || now < last + STATS_PERIOD_MS) return;  
    last = now;

	LOG_INFO( "Output State: %d, current sample rate: %d, bytes per frame: %d", output.state, output.current_sample_rate, BYTES_PER_FRAME);
	LOG_INFO( LINE_MIN_MAX_FORMAT_HEAD1);
	LOG_INFO( LINE_MIN_MAX_FORMAT_HEAD2);
	LOG_INFO( LINE_MIN_MAX_FORMAT_HEAD3);
	LOG_INFO( LINE_MIN_MAX_FORMAT_HEAD4);
	LOG_INFO(LINE_MIN_MAX_FORMAT_STREAM, LINE_MIN_MAX_STREAM("stream",s));
	LOG_INFO(LINE_MIN_MAX_FORMAT,LINE_MIN_MAX("output",o));
	LOG_INFO(LINE_MIN_MAX_FORMAT_FOOTER);
	LOG_INFO(LINE_MIN_MAX_FORMAT,LINE_MIN_MAX("received",rec));
	LOG_INFO(LINE_MIN_MAX_FORMAT_FOOTER);
	LOG_INFO("");
	LOG_INFO("              ----------+----------+-----------+-----------+  ");
	LOG_INFO("              max (us)  | min (us) |   avg(us) |  count    |  ");
	LOG_INFO("              ----------+----------+-----------+-----------+  ");
	LOG_INFO(LINE_MIN_MAX_DURATION_FORMAT,LINE_MIN_MAX_DURATION("Buffering(us)",buffering));
	LOG_INFO(LINE_MIN_MAX_DURATION_FORMAT,LINE_MIN_MAX_DURATION("i2s tfr(us)",i2s_time));
	LOG_INFO("              ----------+----------+-----------+-----------+");
	RESET_ALL_MIN_MAX;
}

/****************************************************************************************
 * SPDIF support
 */
#define PREAMBLE_B  (0xE8) //11101000
#define PREAMBLE_M  (0xE2) //11100010
#define PREAMBLE_W  (0xE4) //11100100

static const u8_t VUCP24[2] = { 0xCC, 0x32 };

static const u16_t spdif_bmclookup[256] = {
	0xcccc, 0xb333, 0xd333, 0xaccc, 0xcb33, 0xb4cc, 0xd4cc, 0xab33, 
	0xcd33, 0xb2cc, 0xd2cc, 0xad33, 0xcacc, 0xb533, 0xd533, 0xaacc, 
	0xccb3, 0xb34c, 0xd34c, 0xacb3, 0xcb4c, 0xb4b3, 0xd4b3, 0xab4c, 
	0xcd4c, 0xb2b3, 0xd2b3, 0xad4c, 0xcab3, 0xb54c, 0xd54c, 0xaab3, 
	0xccd3, 0xb32c, 0xd32c, 0xacd3, 0xcb2c, 0xb4d3, 0xd4d3, 0xab2c, 
	0xcd2c, 0xb2d3, 0xd2d3, 0xad2c, 0xcad3, 0xb52c, 0xd52c, 0xaad3, 
	0xccac, 0xb353, 0xd353, 0xacac, 0xcb53, 0xb4ac, 0xd4ac, 0xab53, 
	0xcd53, 0xb2ac, 0xd2ac, 0xad53, 0xcaac, 0xb553, 0xd553, 0xaaac, 
	0xcccb, 0xb334, 0xd334, 0xaccb, 0xcb34, 0xb4cb, 0xd4cb, 0xab34, 
	0xcd34, 0xb2cb, 0xd2cb, 0xad34, 0xcacb, 0xb534, 0xd534, 0xaacb, 
	0xccb4, 0xb34b, 0xd34b, 0xacb4, 0xcb4b, 0xb4b4, 0xd4b4, 0xab4b, 
	0xcd4b, 0xb2b4, 0xd2b4, 0xad4b, 0xcab4, 0xb54b, 0xd54b, 0xaab4, 
	0xccd4, 0xb32b, 0xd32b, 0xacd4, 0xcb2b, 0xb4d4, 0xd4d4, 0xab2b, 
	0xcd2b, 0xb2d4, 0xd2d4, 0xad2b, 0xcad4, 0xb52b, 0xd52b, 0xaad4, 
	0xccab, 0xb354, 0xd354, 0xacab, 0xcb54, 0xb4ab, 0xd4ab, 0xab54, 
	0xcd54, 0xb2ab, 0xd2ab, 0xad54, 0xcaab, 0xb554, 0xd554, 0xaaab, 
	0xcccd, 0xb332, 0xd332, 0xaccd, 0xcb32, 0xb4cd, 0xd4cd, 0xab32, 
	0xcd32, 0xb2cd, 0xd2cd, 0xad32, 0xcacd, 0xb532, 0xd532, 0xaacd, 
	0xccb2, 0xb34d, 0xd34d, 0xacb2, 0xcb4d, 0xb4b2, 0xd4b2, 0xab4d, 
	0xcd4d, 0xb2b2, 0xd2b2, 0xad4d, 0xcab2, 0xb54d, 0xd54d, 0xaab2, 
	0xccd2, 0xb32d, 0xd32d, 0xacd2, 0xcb2d, 0xb4d2, 0xd4d2, 0xab2d, 
	0xcd2d, 0xb2d2, 0xd2d2, 0xad2d, 0xcad2, 0xb52d, 0xd52d, 0xaad2, 
	0xccad, 0xb352, 0xd352, 0xacad, 0xcb52, 0xb4ad, 0xd4ad, 0xab52, 
	0xcd52, 0xb2ad, 0xd2ad, 0xad52, 0xcaad, 0xb552, 0xd552, 0xaaad, 
	0xccca, 0xb335, 0xd335, 0xacca, 0xcb35, 0xb4ca, 0xd4ca, 0xab35, 
	0xcd35, 0xb2ca, 0xd2ca, 0xad35, 0xcaca, 0xb535, 0xd535, 0xaaca, 
	0xccb5, 0xb34a, 0xd34a, 0xacb5, 0xcb4a, 0xb4b5, 0xd4b5, 0xab4a, 
	0xcd4a, 0xb2b5, 0xd2b5, 0xad4a, 0xcab5, 0xb54a, 0xd54a, 0xaab5, 
	0xccd5, 0xb32a, 0xd32a, 0xacd5, 0xcb2a, 0xb4d5, 0xd4d5, 0xab2a, 
	0xcd2a, 0xb2d5, 0xd2d5, 0xad2a, 0xcad5, 0xb52a, 0xd52a, 0xaad5, 
	0xccaa, 0xb355, 0xd355, 0xacaa, 0xcb55, 0xb4aa, 0xd4aa, 0xab55, 
	0xcd55, 0xb2aa, 0xd2aa, 0xad55, 0xcaaa, 0xb555, 0xd555, 0xaaaa	
};

/* 
 SPDIF is supposed to be (before BMC encoding, from LSB to MSB)				
    0....  1...   191..  0
    BLFMRF MLFWRF MLFWRF BLFMRF (B,M,W=preamble-4, L/R=left/Right-24, F=Flags-4)
    each xLF pattern is 32 bits 
	PPPP AAAA  SSSS SSSS  SSSS SSSS  SSSS VUCP (P=preamble, A=auxiliary, S=sample-20bits, V=valid, U=user data, C=channel status, P=parity)
 After BMC encoding, each bit becomes 2 hence this becomes a 64 bits word. The parity
 is fixed by changing AAAA bits so that VUPC does not change. Then then trick is to 
 start not with a PPPP sequence but with an VUCP sequence to that the 16 bits samples
 are aligned with a BMC word boundary. Input buffer is left first => LRLR...
 The I2S interface must output first the B/M/W preamble which means that second
 32 bits words must be first and so must be marked right channel. 
*/
static void IRAM_ATTR spdif_convert(ISAMPLE_T *src, size_t frames, u32_t *dst) {
    static u8_t vu, count;    
	register u16_t hi, lo;
#if BYTES_PER_FRAME == 8
	register u16_t aux;
#endif
    
    // we assume frame == 0 as well...
    if (!src) {
        count = 0;
        vu = VUCP24[0];
    }
    
	while (frames--) {
		// start with left channel
#if BYTES_PER_FRAME == 4		
		hi = spdif_bmclookup[(u8_t)(*src >> 8)];
		lo = spdif_bmclookup[(u8_t)*src++];
		if (lo & 1) hi = ~hi;

        if (!count--) {            
			*dst++ = (vu << 24) | (PREAMBLE_B << 16) | 0xCCCC;
			count = 191;
		} else {
			*dst++ = (vu << 24) | (PREAMBLE_M << 16) | 0xCCCC;
		}
#else
		hi = spdif_bmclookup[(u8_t)(*src >> 24)];
		lo = spdif_bmclookup[(u8_t)(*src >> 16)];
		aux = spdif_bmclookup[(u8_t)(*src++ >> 8)];
		if (aux & 1) lo = ~lo;
		if (lo & 1) hi = ~hi;


        if (!count--) {
			*dst++ = (vu << 24) | (PREAMBLE_B << 16) | aux;
			count = 191;
		} else {
			*dst++ = (vu << 24) | (PREAMBLE_M << 16) | aux;
		}
#endif

        vu = VUCP24[hi & 1];
		*dst++ = ((u32_t)lo << 16) | hi;

		// then do right channel, no need to check PREAMBLE_B
#if BYTES_PER_FRAME == 4		
		hi = spdif_bmclookup[(u8_t)(*src >> 8)];
		lo = spdif_bmclookup[(u8_t)*src++];
		if (lo & 1) hi = ~hi;

		*dst++ = (vu << 24) | (PREAMBLE_W << 16) | 0xCCCC;
#else
		hi = spdif_bmclookup[(u8_t)(*src >> 24)];
		lo = spdif_bmclookup[(u8_t)(*src >> 16)];
		aux = spdif_bmclookup[(u8_t)(*src++ >> 8)];
		if (aux & 1) lo = ~lo;
		if (lo & 1) hi = ~hi;

		*dst++ = (vu << 24) | (PREAMBLE_W << 16) | aux;
#endif

        vu = VUCP24[hi & 1];
		*dst++ = ((u32_t)lo << 16) | hi;
	}
}
